sol(1):-

In [1]:
import pandas as pd
a=pd.Series([4, 8, 15, 16, 23,42])
a

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

SOL(2):-

In [3]:
a=[1,53,42,4,24,3,524,7,7,54,53]
pd.Series(a)

0       1
1      53
2      42
3       4
4      24
5       3
6     524
7       7
8       7
9      54
10     53
dtype: int64

SOL(3):-

In [22]:
q=pd.DataFrame({'Name':['Alice','Bob','Claire'],'Age':[25,30,27],"Gender":['Female','Male','Female']})

In [23]:
q

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4.
Data frame is a function in Pandas library in Python and it is used to make the data frame from the dictionary and the series function is a function which is used in Pandas library in Python which provide series.

In [28]:
q.head()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [29]:
q.tail()

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [30]:
q.describe()

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

Q6.Data frame is mutable and series is immutable.

Q7.

In [54]:
a=pd.Series([54,3,3,2,32,32,32,3,2])
b=pd.Series([12,15,15,11,51,15])

In [55]:
w=pd.DataFrame({'age':a,'height':b})

In [56]:
w

   age  height
0   54    12.0
1    3    15.0
2    3    15.0
3    2    11.0
4   32    51.0
5   32    15.0
6   32     NaN
7    3     NaN
8    2     NaN